import { gridImage1,gridImage2,gridImage3,gridImage4,gridImage5,gridImage6,gridImage7,gridImage8,gridImage9,gridImage10,gridImage11,gridImage12 } from "../assets"




export const gridCards = [
    {
        image: gridImage1,
        title: "    چگونه آموزش ببینیم؟",
        desc: " همانطور که از عنوان مقاله مشخص است، صحبت ما روی آموزش یک موضوع خاص مثل آموزش از کتاب،  یا هر آنچه که برای ...",
        viewNum: "4483",
        smsNum:"3",
        writer:"تاپ لرن"
    },
    {
        image: gridImage2,
        title: "چرا یک سئو کار باید برنامه نویس خوبی باشد",
        desc: "همانطور که می دانید سئو یکی از مهم ترین عوامل موفقیت در کسب و کار های اینترنتی می باشد. امروزه شاهد بیزینس های ...",
        viewNum: "3037",
        smsNum:"1",
        writer:"تاپ لرن"
    },
    {
        image: gridImage3,
        title: "آشنایی با برنامه نویسی",
        desc: "در دنیای امروزی، اکثر مشاغل و کار‌ها با کامپیوتر‌ها پیوندی جدا نشدنی پیدا کرده‌اند به گونه‌ای که علوم کامپیوتری لازمه‌ای برای ...",
        viewNum: "3833",
        smsNum:"11",
        writer:"امین آیرم"
    },
    {
        image: gridImage4,
        title: "نرم افراز متلب چیست و چه کاربردی دارد؟",
        desc: "اگر در هر یک از رشته های مهندسی تحصیل می کنید احتمالا نام نرم افزار متلب به گوش شما آشنا باشد در این مقاله قصد دارم  ...",
        viewNum: "3260",
        smsNum:"2",
        writer:"حسین سینائی"
    },
    {
        image: gridImage5,
        title: "Google Colab چیست؟",
        desc: "زبان برنامه نویسی پایتون را کم وبیش اکثر برنامه نویس ها و مهندسان جهان می شناسند. و بیشتر تکنولوژی از جمله ...",
        viewNum: "6230",
        smsNum:"7",
        writer:"حسین سینائی"
    },
    {
        image: gridImage6,
        title: "6 دلیل که ++C هنوز در حال استفاده است",
        desc: "زبان برنامه نویسی معروف ++C یک زبان برنامه نویسی عمومی است که بیش از 40 سال است که برای برنامه نویسی ...",
        viewNum: "8467",
        smsNum:"7",
        writer:"ایمان مدائنی"
    },
    {
        image: gridImage7,
        title: "8 دلیل انتخاب تایپ اسکریپت در سال 2022",
        desc: "TypeScript به یک زبان محبوب برای توسعه برنامه‌های بزرگ تبدیل شده است. تایپ اسکریپت جاوااسکریپت جدید است، درست ...",
        viewNum: "5402",
        smsNum:"6",
        writer:"ایمان مدائنی"
    },
    {
        image: gridImage8,
        title: "12 ابزار رایگان برای طراحی API و تست آن",
        desc: "ظهور API های RESTful با افزایش ابزارهایی برای ایجاد، آزمایش و مدیریت آنها همراه شده است. فرقی نمی کند که شما یک شخص ...",
        viewNum: "5744",
        smsNum:"4",
        writer:"ایمان مدائنی"
    },
    {
        image: gridImage9,
        title: "آشنایی با ترند های تکنولوژی در سال 2022",
        desc: "امروزه صنعت تکنولوژی روز به روز در حال پیشرفت است و شاهد آن هستیم که هر روزه ترندهای تکنولوژی در حال پیشرفت هستند ...",
        viewNum: "3774",
        smsNum:"2",
        writer:"ایمان مدائنی"
    },
    {
        image: gridImage10,
        title: "متدولوژی agile چیست ؟ توسعه نرم افزار مدرن",
        desc: "شاید باور کردن این مسئله بسیار سخت باشد که امسال متدولوژی agile  بیست ساله شد. این روش در واقع روشی بود که زمانی  ...",
        viewNum: "3313",
        smsNum:"1",
        writer:"ایمان مدائنی"
    },
    {
        image: gridImage11,
        title: "کتابخانه بند کفش (ShoeLace) و مزایای آن",
        desc: "همانطور که می‌دانید برنامه نویسی وب، امروزه یکی از پرکاربردترین علوم از علوم کامپیوتری هست. طراحی سمت کاربر وب، یکی از ...",
        viewNum: "2013",
        smsNum:"1",
        writer:"امیرحسین باقری"
    },
    {
        image: gridImage12,
        title: "چرا باید الکترون (ElectronJs) را یاد بگیریم؟",
        desc: "فریم ورک الکترون یکی از بهترین فریم ورک های دسکتاپ است، ما در این مطلب قصد داریم به بررسی فریم ورک الکترون و مزایا و ...",
        viewNum: "2555",
        smsNum:"4",
        writer:"علی رضایی"
    },

]